//mkfs n – ініціалізувати ФС, n – це кількість дескрипторів файлів.
// • stat pathname – вивести інформацію про файл (дані дескриптору файлу).
// • ls – вивести список жорстких посилань на файли в CWD із зазначенням номерів
// дескрипторів файлів.
// • create pathname – створити новий звичайний файл та створити відповідне жорстке
// посилання на нього.
// • fd = open pathname – відкрити звичайний файл, на який вказує шляхове ім’я pathname.
// Команда повинна призначити найменший вільний номер (назвемо цей номер «числовий
// дескриптор файлу») для роботи з відкритим файлом (це число – це не те саме, що номер
// дескриптору файлу у ФС). Один файл може бути відкритий кілька разів. Кількість
// числових дескрипторів файлів може бути обмежена.
// • close fd – закрити раніше відкритий файл з числовим дескриптором файлу fd, номер fd
// стає вільним.
// • seek fd offset – вказати зміщення для відкритого файлу, де почнеться наступне читання
// з або запис у файл (далі «зміщення»). При відкритті файлу зміщення дорівнює нулю. Це
// зміщення вказується тільки для цього fd.
// • read fd size – прочитати size байт даних з відкритого файлу, до значення зміщення
// додається size.
// • write fd size – записати size байт даних у відкритий файл, до значення зміщення
// додається size.
// • link pathnam1 pathname2 – створити жорстке посилання, вказане в pathname2, на файл,
// на який вказує шляхове ім’я pathname1.
// • unlink pathname – знищити жорстке посилання на файл, вказане в pathname.
// • truncate pathname size – змінити розмір файлу, на який вказує шляхове ім’я pathname.
// Якщо розмір файлу збільшується, тоді неініціалізовані дані дорівнюють нулям.
// Друга частина команд, яка дозволяє створювати дерево директорій та символічні посилання і,
// відповідно, мають працювати шляхові ім’я у всіх командах
// • mkdir pathname – створити нову директорію та створити жорстке посилання на неї,
// вказане в pathname.
// • rmdir pathname – звільнити порожню директорію на яке вказує шляхове ім’я, та знищити
// відповідне жорстке посилання на неї (вміст директорії не повинен мати жодного
// жорсткого посилання, крім наперед визначених жорстких посилань з іменами . та ..).
// • cd pathname – змінити поточну робочу директорію.
// • symlink str pathname – створити символічне посилання з вмістом str та створити на
// нього відповідне жорстке посилання. Максимальна довжина вмісту символічного посилання str не має перевищувати розмір одного блоку

export const mkfs = n => {
    /**
     * ініціалізувати ФС
     * @param n Number кількість дескрипторів файлів
     * */
    return null
}

export const stat = pathname => {
    /**
     * – вивести інформацію про файл
     * (дані дескриптору файлу).
     * @param pathname String
     * */
    return null
}

export const ls = () => {
    /**
     * вивести список жорстких посилань на файли в CWD
     * із зазначенням номерів
     * дескрипторів файлів
     * */
    return null
}